/*
Navicat MySQL Data Transfer

Source Server         : mysql
Source Server Version : 50623
Source Host           : localhost:3306
Source Database       : cemission

Target Server Type    : MYSQL
Target Server Version : 50623
File Encoding         : 65001

Date: 2018-06-01 15:22:40
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for account
-- ----------------------------
DROP TABLE IF EXISTS `account`;
CREATE TABLE `account` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `username` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '用户名',
  `password` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '密码',
  `role` varchar(255) CHARACTER SET utf8mb4 NOT NULL COMMENT '角色',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of account
-- ----------------------------
INSERT INTO `account` VALUES ('1', 'admin', 'admin', '管理员');
INSERT INTO `account` VALUES ('3', 'spring ', 'mvc', '管理员');
INSERT INTO `account` VALUES ('4', 'mvc', 'mvc', '普通用户');

-- ----------------------------
-- Table structure for area
-- ----------------------------
DROP TABLE IF EXISTS `area`;
CREATE TABLE `area` (
  `id` int(10) NOT NULL,
  `area` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of area
-- ----------------------------
INSERT INTO `area` VALUES ('1', 'hexiOasis');
INSERT INTO `area` VALUES ('2', 'loessPlateau');
INSERT INTO `area` VALUES ('3', 'qbMountains');
INSERT INTO `area` VALUES ('4', 'gannanTibetan');

-- ----------------------------
-- Table structure for cemission_value
-- ----------------------------
DROP TABLE IF EXISTS `cemission_value`;
CREATE TABLE `cemission_value` (
  `id` int(10) NOT NULL,
  `code` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `year` varchar(255) COLLATE utf8mb4_bin NOT NULL,
  `cvalue` float(8,3) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of cemission_value
-- ----------------------------
INSERT INTO `cemission_value` VALUES ('1', '11', '2015', '1977.550');
INSERT INTO `cemission_value` VALUES ('2', '22', '2015', '300.000');
INSERT INTO `cemission_value` VALUES ('3', '33', '2015', '100.000');
INSERT INTO `cemission_value` VALUES ('4', '44', '2015', '150.000');
INSERT INTO `cemission_value` VALUES ('5', '11', '2016', '2136.480');
INSERT INTO `cemission_value` VALUES ('6', '22', '2016', '200.000');
INSERT INTO `cemission_value` VALUES ('7', '33', '2016', '450.000');
INSERT INTO `cemission_value` VALUES ('8', '44', '2016', '300.000');
INSERT INTO `cemission_value` VALUES ('9', '11', '2017', '2279.090');
INSERT INTO `cemission_value` VALUES ('10', '22', '2017', '250.000');
INSERT INTO `cemission_value` VALUES ('11', '33', '2017', '300.000');
INSERT INTO `cemission_value` VALUES ('12', '44', '2017', '200.000');
INSERT INTO `cemission_value` VALUES ('13', '11', '2018', '2418.460');
INSERT INTO `cemission_value` VALUES ('14', '22', '2018', '100.000');

-- ----------------------------
-- Table structure for chanliang
-- ----------------------------
DROP TABLE IF EXISTS `chanliang`;
CREATE TABLE `chanliang` (
  `id` int(10) NOT NULL,
  `springWheat` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `winterWheat` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `rice` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `maize` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sorghum` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `foxtailMillet` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `broomcornMillet` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `soybean` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `potato` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `cotton` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `flaxseed` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `rapeseed` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sunflowerSeed` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `hemp` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sugarBeet` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `tobaccoLeaf` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `angelica` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `codonopsisPilosula` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `aid` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of chanliang
-- ----------------------------

-- ----------------------------
-- Table structure for fertilizer
-- ----------------------------
DROP TABLE IF EXISTS `fertilizer`;
CREATE TABLE `fertilizer` (
  `id` int(11) NOT NULL,
  `n` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `p` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `k` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `seCo2` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `aNa1` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `seN2o` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `aNa2` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of fertilizer
-- ----------------------------

-- ----------------------------
-- Table structure for parametermanager
-- ----------------------------
DROP TABLE IF EXISTS `parametermanager`;
CREATE TABLE `parametermanager` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `parameter_name` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '参数名称（农作物名称、家畜名称等）',
  `cemission_coefficient` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '碳排放系数',
  `parameter_type` varchar(255) COLLATE utf8mb4_bin NOT NULL COMMENT '参数类别（农作物、家畜）',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of parametermanager
-- ----------------------------
INSERT INTO `parametermanager` VALUES ('1', '葵花', '11', '农作物');
INSERT INTO `parametermanager` VALUES ('2', '玉米', '34', '农作物');
INSERT INTO `parametermanager` VALUES ('3', '奶牛', '33', '家畜');
INSERT INTO `parametermanager` VALUES ('4', '地膜', '44', '农用品');
INSERT INTO `parametermanager` VALUES ('5', '灌溉', '55', '其他');
INSERT INTO `parametermanager` VALUES ('6', '蛋鸡', '66', '家畜');
INSERT INTO `parametermanager` VALUES ('7', '柴油', '77', '农用品');
INSERT INTO `parametermanager` VALUES ('9', '猪', '00', '家畜');
INSERT INTO `parametermanager` VALUES ('10', '苜蓿', '12', '农作物');
INSERT INTO `parametermanager` VALUES ('11', '小麦', '0.32(kg CO2-eq/kg DM)', '农作物');

-- ----------------------------
-- Table structure for pesticide
-- ----------------------------
DROP TABLE IF EXISTS `pesticide`;
CREATE TABLE `pesticide` (
  `id` int(11) NOT NULL,
  `herbicides` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `insecticides` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `fungicides` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of pesticide
-- ----------------------------

-- ----------------------------
-- Table structure for quanshengdata
-- ----------------------------
DROP TABLE IF EXISTS `quanshengdata`;
CREATE TABLE `quanshengdata` (
  `year` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `code` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `county` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `climatetype` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `landArea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `average` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `njrainfall` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `njair` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `frostless` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `njsunshine` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `totallabor` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `labor` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `yxarea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `lsarea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `lstotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `xmarea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `xmtotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `ymarea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `ymtotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `mharea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `mhtotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `ylarea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `yltotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `dgarea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `dgtotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `dsarea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `dstotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `pigcunl` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `cattlecunl` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sheepcunl` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `cattlechul` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `pigchul` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sheepchul` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `pigtotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `cattletotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sheeptotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `mymtotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `symtotal` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `qeggs` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `ncyd` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `nchf` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `nyjx` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `gdarea` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `nbzara` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of quanshengdata
-- ----------------------------
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');
INSERT INTO `quanshengdata` VALUES ('2015', '11', '民勤县', '温带大陆性季风气候', '16016', '1400', '110', '8', '162', '3074', '11', '8', '53', '16', '139620', '4', '34422', 'null', '10', '101712', 'null', '5', '9000', '12', '64761', '0', '0', '0', '0', '6', '4', '107', '2', '7', '66', '5002', '1855', '9865', '1608', '23', '3097', '12532', '42082', '1457806');
INSERT INTO `quanshengdata` VALUES ('2015', '12', '甘州区', '温带大陆性气候', '4240', '1474', '', '8', '158', '3300', '23', '12', '63', '50', '423668', '4', '28939', 'null', '43', '374105', 'null', '0', 'null', '1', '3400', '0', '0', '0', '0', '26', '29', '72', '12', '34', '40', '23604', '12792', '6376', '1744', '49', '9666', '20719', '42869', '757210');
INSERT INTO `quanshengdata` VALUES ('2015', '13', '临泽县', '大陆性荒漠草原气候', '2727', '1454', '118', '8', '176', '3053', '7', '3', '28', '21', '155539', '1', '6541', 'null', '20', '148390', 'null', '0', '247', '0', '467', '0', '0', '0', '0', '11', '12', '15', '6', '13', '10', '8202', '5783', '1454', '257', '3', '1569', '6904', '12384', '428600');
INSERT INTO `quanshengdata` VALUES ('2015', '14', '肃州区', '大陆性气候', '3354', '1600', '88', '7', '130', '3033', '13', '7', '41', '19', '160934', '3', '24594', 'null', '15', '133620', 'null', 'null', 'null', '1', '2581', '0', '0', '0', '0', '10', '10', '84', '9', '12', '76', '8162', '8688', '11028', '2019', '40', '7344', '10260', '24320', '851107');
INSERT INTO `quanshengdata` VALUES ('2015', '15', '瓜州县', '温带大陆性气候', '24130', '1500', '45', '9', 'null', 'null', '6', '4', '39', '5', '33191', '3', '15689', 'null', '3', '17502', 'null', '6', '9824', '3', '13442', '0', '0', '0', '0', '2', '2', '43', '1', '2', '33', '1470', '895', '4986', '767', '47', '331', '11144', '16006', '374000');
INSERT INTO `quanshengdata` VALUES ('2015', '21', '静宁县', '暖温带半湿润半干旱气候', '2193', '1800', '451', '7', '159', '2238', '22', '15', '11', '80', '213168', '30', '85095', 'null', '24', '86819', 'null', '0', '0', '7', '12074', '0', '0', '0', '1157', '11', '10', '0', '1', '13', '0', '8872', '1338', '23', '1', '', '2279', '9003', '26128', '321792');
INSERT INTO `quanshengdata` VALUES ('2015', '22', '环县', '温带大陆性季风气候', '9236', '1505', '300', '9', '200', '2600', '17', '9', '4', '123', '371614', '13', '24530', 'null', '86', '314703', 'null', '0', '0', '9', '12788', '0', '0', '0', '0', '7', '4', '78', '2', '7', '36', '5199', '2092', '5810', '18', '311', '1329', '19648', '21989', '237814');
INSERT INTO `quanshengdata` VALUES ('2015', '23', '镇原县', '北温带大陆性气候', '3500', '1456', '450～580', '8', '140～180', '2250～2440', '21', '12', '11', '100', '384131', '27', '99592', 'null', '67', '277073', 'null', '0', '0', '13', '34824', '0', '986', '0', '901', '5', '11', '24', '5', '5', '10', '4010', '5713', '1534', '137', '75', '4422', '7595', '20359', '330144');
INSERT INTO `quanshengdata` VALUES ('2015', '24', '通渭县', '温带半湿润半干旱性季风气候', '2908', '1970', '380', '8', '147', '2100～2430', '23', '14', '4', '32', '460599', '21', '56499', 'null', '55', '341655', 'null', '0', '0', '7', '15016', '0', '233', '2', '5291', '4', '5', '4', '1', '12', '2', '8218', '1099', '322', '39', '4', '1735', '4746', '19490', '881338');
INSERT INTO `quanshengdata` VALUES ('2015', '25', '榆中县', '大陆性季风气候', '3301', '1700', '350', '7', '120', '2666', '20', '12', '20', '49', '171599', '12', '44028', 'null', '18', '77879', 'null', '0', '0', '3', '5420', '0', '88', '1', '914', '12', '2', '13', '0', '10', '8', '7491', '338', '1228', '140', '23', '3226', '5856', '21319', '427093');
INSERT INTO `quanshengdata` VALUES ('2015', '31', '武都区', '亚热带半湿润气候', '4683', '1200', '400', '15', '210～240', '1911', '26', '11', '11', '55', '183089', '12', '47293', 'null', '10', '42993', 'null', '0', '13', '2', '2940', '1', '2008', '3', '5728', '5', '5', '6', '1', '21', '4', '14803', '860', '609', '8', '17', '1733', '9343', '11948', '358500');
INSERT INTO `quanshengdata` VALUES ('2015', '32', '康县', '南北过渡性暖温带半湿润气候', '2958', '1426', '732', '12', '207', '1434', '10', '7', '4', '31', '77322', '11', '35289', 'null', '8', '26808', 'null', '0', '0', '1', '835', '0', '3', '0', '10', '3', '3', '2', '1', '6', '1', '4428', '720', '204', '', '10', '1336', '1468', '5941', '126575');
INSERT INTO `quanshengdata` VALUES ('2015', '33', '文县', '亚热带北缘山地气候', '4994', '1500～2500', '400～1000', '', '260', '1200～1800', '12', '7', '6', '26', '76838', '6', '18678', 'null', '9', '36218', 'null', '0', '0', '2', '3415', '0', '110', '5', '5142', '3', '3', '5', '0', '10', '2', '6965', '384', '304', '', '22', '1003', '3564', '3733', '260339');
INSERT INTO `quanshengdata` VALUES ('2015', '34', '徽县', '亚热带向暖温带过渡性的大陆季风气候', '2772', '900', '746', '11', '173', '1126', '10', '5', '7', '36', '171826', '12', '57316', 'null', '11', '76893', 'null', '0', '0', '5', '7301', '0', '815', '0', '830', '14', '6', '2', '2', '15', '1', '10717', '1964', '176', '3', '9', '1761', '4388', '13877', '238100');
INSERT INTO `quanshengdata` VALUES ('2015', '35', '礼县', '温带大陆性季风气候', '4299', '1520', '488', '10', '183', '1968', '24', '14', '16', '58', '160879', '25', '76454', 'null', '8', '30797', 'null', '0', '0', '5', '6139', '0', '545', '0', '890', '8', '8', '10', '3', '17', '6', '11684', '2767', '854', '4', '17', '1650', '3847', '10139', '258047');
INSERT INTO `quanshengdata` VALUES ('2015', '41', '合作市', '高原性气候', '2670', '2936', '545', '2', '48', 'null', '2', '2', '0', '5', '10371', '0', '673', 'null', '0', '0', 'null', '0', '0', '2', '2530', '0', '18', '0', '0', '1', '11', '17', '3', '2', '9', '513', '2643', '1609', '154', '6', '0', '426', '162', '36688');
INSERT INTO `quanshengdata` VALUES ('2015', '42', '玛曲县', '高原性气候', '10190', '3650', '496', '1', '无绝对霜期', '26912', '2', '2', '0', '0', '0', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '0', '0', '0', '0', '0', '0', '5', '49', '16', '0', '20', '0', '13737', '4094', '505', '0', '0', '411', '0', '4000');
INSERT INTO `quanshengdata` VALUES ('2015', '43', '碌曲县', '高原气候带高原湿润气候', '5298', '3500', '633～782', '2', '无绝对霜期', '2358', '2', '1', '0', '2', '3048', '0', '0', 'null', '0', '0', 'null', '0', '0', '0', '355', '0', '0', '0', '0', '1', '19', '38', '5', '0', '22', '288', '4543', '3962', '406', '0', '0', '236', '18', '13580');
INSERT INTO `quanshengdata` VALUES ('2015', '44', '临潭县', '高原性气候', '1558', '2825', '383.2～668.2', '3', '65', '2314', '8', '5', '2', '5', '673', '2', '5782', 'null', '0', '0', 'null', '0', '0', '4', '6595', '4', '7844', '0', '534', '4', '5', '14', '2', '5', '9', '3046', '1665', '1322', '96', '30', '42', '1483', '1616', '127548');
INSERT INTO `quanshengdata` VALUES ('2015', '45', '迭部县', '非典型性大陆性气候', '5108', '2400', '637', '10', '147', '2242', '2', '1', '1', '4', '10710', '2', '3700', 'null', '0', '899', 'null', '0', '0', '0', '628', '1', '763', '0', '107', '5', '10', '3', '2', '4', '2', '1287', '2303', '308', '28', '0', '167', '1296', '92', '35930');

-- ----------------------------
-- Table structure for seed
-- ----------------------------
DROP TABLE IF EXISTS `seed`;
CREATE TABLE `seed` (
  `id` int(10) NOT NULL,
  `springWheat` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `winterWheat` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `rice` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `maize` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sorghum` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `foxtailMillet` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `broomcornMillet` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `soybean` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `potato` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `cotton` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `flaxseed` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `rapeseed` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sunflowerSeed` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `hemp` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `sugarBeet` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `tobaccoLeaf` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `angelica` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  `codonopsisPilosula` varchar(255) COLLATE utf8mb4_bin DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- ----------------------------
-- Records of seed
-- ----------------------------
